In [1]:
import pandas as pd
import numpy as np

from sklearn import preprocessing

In [2]:
nba_df = pd.read_csv('data/NBA_player_of_the_week.csv')

nba_df

,Player,Team,Conference,Date,Position,Height,Weight,Age,Draft Year,Seasons in league,Season,Season short,Pre-draft Team,Real_value,Height CM,Weight KG,Last Season
0,Jayson Tatum,Boston Celtics,East,"Feb 10, 2020",SF,6'8,208,21,2017,2,2019-2020,2020,Duke,0.5,203,94,1
1,Nikola Jokic,Denver Nuggets,West,"Feb 10, 2020",C,7'0,250,25,2014,4,2019-2020,2020,KK Mega Bemax (Serbia),0.5,213,113,1
2,Jaylen Brown,Boston Celtics,East,"Feb 3, 2020",SF,6'7,220,23,2016,3,2019-2020,2020,California,0.5,201,99,1
3,Damian Lillard,Portland Trail Blazers,West,"Feb 3, 2020",G,6'3,195,29,2012,7,2019-2020,2020,Weber State,0.5,190,88,1
4,Pascal Siakam,Toronto Raptors,East,"Jan 27, 2020",F,6'9,230,25,2016,3,2019-2020,2020,New Mexico State,0.5,206,104,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1335,Phil Ford,Kansas City Kings,NaN,"Nov 18, 1979",G,6'2,175,24,1978,1,1979-1980,1980,North Carolina,1.0,188,79,0
1336,Magic Johnson,Los Angeles Lakers,NaN,"Nov 11, 1979",PG,6'9,255,20,1979,0,1979-1980,1980,Michigan State,1.0,206,115,0
1337,Marques Johnson,Milwaukee Bucks,NaN,"Nov 4, 1979",GF,6'7,218,24,1977,2,1979-1980,1980,UCLA,1.0,201,98,0
1338,Micheal Ray Richardson,New York Knicks,NaN,"Oct 28, 1979",PG,6'5,189,24,1978,1,1979-1980,1980,Montana,1.0,196,85,0
1339,Julius Erving,Philadelphia Sixers,NaN,"Oct 21, 1979",SF,6'6,200,30,1972,7,1979-1980,1980,Massachusetts,1.0,198,90,0

In [3]:
nba_df.describe()

,Weight,Age,Draft Year,Seasons in league,Season short,Real_value,Height CM,Weight KG,Last Season
count,1340.000000,1340.000000,1340.000000,1340.000000,1340.000000,1340.000000,1340.000000,1340.000000,1340.000000
mean,224.567164,26.738060,1996.287313,5.740299,2003.156716,0.686940,201.071642,101.384328,0.023881
std,30.798885,3.400683,11.253558,3.293421,11.470164,0.242007,9.367970,14.011226,0.152734
min,150.000000,19.000000,1965.000000,0.000000,1980.000000,0.500000,175.000000,68.000000,0.000000
25%,205.000000,24.000000,1987.000000,3.000000,1994.000000,0.500000,193.000000,93.000000,0.000000
50%,220.000000,26.000000,1998.000000,5.000000,2005.000000,0.500000,201.000000,99.000000,0.000000
75%,250.000000,29.000000,2005.000000,8.000000,2013.000000,1.000000,208.000000,113.000000,0.000000
max,325.000000,40.000000,2018.000000,17.000000,2020.000000,1.000000,229.000000,147.000000,1.000000

In [4]:
nba_fdf = nba_df[['Height CM', 'Weight KG', "Age"]]

nba_fdf

scaler = preprocessing.MinMaxScaler()

nor_n = scaler.fit_transform(nba_fdf)

n_df = pd.DataFrame(nor_n, columns=['Height','Height','Age'])

n_df.describe()

            Height       Height          Age
count  1340.000000  1340.000000  1340.000000
mean      0.482808     0.422586     0.368479
std       0.173481     0.177357     0.161937
min       0.000000     0.000000     0.000000
25%       0.333333     0.316456     0.238095
50%       0.481481     0.392405     0.333333
75%       0.611111     0.569620     0.476190
max       1.000000     1.000000     1.000000

In [14]:

a = pd.DataFrame([25, 35, 30, 50, 35], columns=['wow'])


scaler = preprocessing.MinMaxScaler()


a_scaled = scaler.fit_transform(a)


a_scaled

array([[0. ],
       [0.4],
       [0.2],
       [1. ],
       [0.4]])

In [18]:
# 필요한 도구 import
from sklearn import preprocessing
import pandas as pd

PATIENT_FILE_PATH = './datasets/liver_patient_data.csv'
pd.set_option('display.float_format', lambda x: '%.5f' % x)

# 데이터 파일을 pandas dataframe으로 가지고 온다
liver_patients_df = pd.read_csv(PATIENT_FILE_PATH)

# Normalization할 열 이름들
features_to_normalize = ['Total_Bilirubin','Direct_Bilirubin', 'Alkaline_Phosphotase', 'Alamine_Aminotransferase']

# 여기에 코드를 작성하세요

a = liver_patients_df[features_to_normalize]
scaler = preprocessing.MinMaxScaler()

a_scaled = scaler.fit_transform(a)

normalized_df = pd.DataFrame(a_scaled,columns=features_to_normalize)


# 테스트 코드
normalized_df.describe()

,Total_Bilirubin,Direct_Bilirubin,Alkaline_Phosphotase,Alamine_Aminotransferase
count,579.00000,579.00000,579.00000,579.00000
mean,0.03908,0.07113,0.11156,0.03574
std,0.08348,0.14370,0.11898,0.09205
min,0.00000,0.00000,0.00000,0.00000
25%,0.00536,0.00510,0.05496,0.00653
50%,0.00804,0.01020,0.07084,0.01256
75%,0.02949,0.06122,0.11480,0.02563
max,1.00000,1.00000,1.00000,1.00000

In [20]:
tit_df = pd.read_csv('datasets/titanic.csv')

tit_df.head()

,Unnamed: 0,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,0,3,"Braund, Mr. Owen Harris",male,22.00000,1,0,A/5 21171,7.25000,NaN,S
1,1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.00000,1,0,PC 17599,71.28330,C85,C
2,2,1,3,"Heikkinen, Miss. Laina",female,26.00000,0,0,STON/O2. 3101282,7.92500,NaN,S
3,3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.00000,1,0,113803,53.10000,C123,S
4,4,0,3,"Allen, Mr. William Henry",male,35.00000,0,0,373450,8.05000,NaN,S

In [25]:
a = tit_df[['Sex','Embarked']]
a

b = pd.get_dummies(a)

b.head()

   Sex_female  Sex_male  Embarked_C  Embarked_Q  Embarked_S
0       False      True       False       False        True
1        True     False        True       False       False
2        True     False       False       False        True
3        True     False       False       False        True
4       False      True       False       False        True

In [26]:
c= pd.get_dummies(data=tit_df, columns=['Sex','Embarked'])

c

,Unnamed: 0,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,0,0,3,"Braund, Mr. Owen Harris",22.00000,1,0,A/5 21171,7.25000,NaN,False,True,False,False,True
1,1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.00000,1,0,PC 17599,71.28330,C85,True,False,True,False,False
2,2,1,3,"Heikkinen, Miss. Laina",26.00000,0,0,STON/O2. 3101282,7.92500,NaN,True,False,False,False,True
3,3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.00000,1,0,113803,53.10000,C123,True,False,False,False,True
4,4,0,3,"Allen, Mr. William Henry",35.00000,0,0,373450,8.05000,NaN,False,True,False,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,"Montvila, Rev. Juozas",27.00000,0,0,211536,13.00000,NaN,False,True,False,False,True
887,887,1,1,"Graham, Miss. Margaret Edith",19.00000,0,0,112053,30.00000,B42,True,False,False,False,True
888,888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,1,2,W./C. 6607,23.45000,NaN,True,False,False,False,True
889,889,1,1,"Behr, Mr. Karl Howell",26.00000,0,0,111369,30.00000,C148,False,True,True,False,False
890,890,0,3,"Dooley, Mr. Patrick",32.00000,0,0,370376,7.75000,NaN,False,True,False,True,False